nghia12a1-t-ara/STM32_myDevelopment_Framework/STM32F4_Drivers/USART/src/USART.c
/**
 * Filename		: USART.c
 * Author		: Nghia Taarabt
 * Create Date 	: 18/12/22
 * Brief		: Implement USART Driver
 */

#include "USART.h"
#include "USART_HwAccess.h"

/*****************************************************************************************/
/************************************ Private Variables **********************************/
/* Pointer to Usart runtime state structure */
static Usart_StateRuntimeType * Usart_StateRuntime_Pointer[USART_INSTANCE_COUNT] = {NULL_PTR};

/** @brief User config structure. */
const Usart_UserConfigType * Usart_UserConfig_Pointer[USART_INSTANCE_COUNT];

static USART_Type * const Usart_Base_Pointer[USART_INSTANCE_COUNT] = USART_BASE_PTRS;

/*****************************************************************************************/
/************************************ Private Functions **********************************/
static Usart_StatusType Usart_StartSendDataINT(const uint8 Instance, const uint8 *TxBuff, const uint32 TxSize);
static Usart_StatusType Usart_StartReceiveDataINT(const uint8 Instance, uint8 * RxBuff, const uint32 RxSize);
static void Usart_PutData(const uint8 Instance);
static void Usart_GetData(const uint8 Instance);
static void Usart_StartGetData(const uint8 Instance, uint32 * StartTime, uint32 * ElapsedTicks, uint32 TimeoutTicks);

/* ----------------- Interrupt Handler Functions ----------------- */
static void Usart_RxIrqHandler(const uint8 Instance);
static void Usart_TxEmptyIrqHandler(const uint8 Instance);
static void Usart_TxCompleteIrqHandler(const uint8 Instance);
static void Usart_ErrIrqHandler(const uint8 Instance);

static void Usart_CompleteReceiveDataINT(const uint8 Instance);
static void Usart_CompleteSendDataINT(const uint8 Instance);
static Usart_StatusType Usart_StartSendDataINT(const uint8 Instance, const uint8 *TxBuff, const uint32 TxSize);
static Usart_StatusType Usart_StartReceiveDataINT(const uint8 Instance, uint8 * RxBuff, const uint32 RxSize);

/*****************************************************************************************/
/*********************************************************************
 * @fn      		  - USART_Init
 *
 * @brief             - Initialize USART Driver
 *
 * @param[in]         - Instance 	- USART Hardware Instance
 * @param[in]         - UserConfig 	- USART User Configuration
 *
 * @return            -
 *
 * @Note              -
 */
void USART_Init(const uint8 Instance, const Usart_UserConfigType * UserConfig)
{
	USART_Type * Base = Usart_Base_Pointer[Instance];
	Usart_StateRuntimeType * UartStatePtr;
	uint8 * ClearStructPtr;
	uint8 Index;
	
	/* Assign Configuration to Static Variables */
	Usart_UserConfig_Pointer[Instance] 		= UserConfig;
	Usart_StateRuntime_Pointer[Instance] 	= UserConfig->StateStruct;
	UartStatePtr = Usart_StateRuntime_Pointer[Instance];
	ClearStructPtr = (uint8 *)UartStatePtr;
	
    /* Clear the state structure for this Instance. */
    for (Index = 0; Index < sizeof(Usart_StateRuntimeType); Index++)
    {
        ClearStructPtr[Index] = 0;
    }	
	
	/* Implement the code to enable the Clock for given USART peripheral */
	USART_PeriClockControl(Base, ENABLE);
	
	/* Enable USART TX and RX engines according to the USART_Mode configuration item */
	USART_SetTransferMode(Base, UserConfig->USART_Mode);
	
	/* Implement the code to configure the Word length configuration item */
	USART_SetWordLength(Base, UserConfig->USART_WordLength);
	
	/* Configuration of parity control bit fields */
	USART_SetParity(Base, UserConfig->USART_ParityControl);
	
	/* Implement the code to configure the number of stop bits inserted during USART frame transmission */
	USART_SetStopBits(Base, UserConfig->USART_NoOfStopBits);
	
	/* Configuration of USART hardware flow control */
	USART_SetHWFlowControl(Base, UserConfig->USART_HWFlowControl);
	
	/* ---------------- Setup Baud-rate for USART Instance ---------------- */
	Usart_SetBaudRate(Instance, UserConfig->USART_Baud);
	
    /* Initialize last driver operation status */
	UartStatePtr->IsTxBusy 			= FALSE;
	UartStatePtr->IsRxBusy			= FALSE;
	UartStatePtr->TransmitStatus 	= USART_STATUS_SUCCESS;
	UartStatePtr->ReceiveStatus 	= USART_STATUS_SUCCESS;
	UartStatePtr->USART_Baud 		= UserConfig->USART_Baud;
	
	/* ---------------- Enable USART Instance ---------------- */
	USART_PeripheralControl(Base, ENABLE);
}

/*********************************************************************
 * @fn      		  - Usart_SyncSendData
 *
 * @brief             - Synchronous Send Data - Wait to send ok or timeout
 *
 * @param[in]         - Instance 	- USART Hardware Instance
 * @param[in]         - TxBuff 		- Buffer to transmission
 * @param[in]         - TxSize 		- Size of Buffer to transmission
 * @param[in]         - Timeout 	- Timeout if data cannot transmit
 *
 * @return            - Usart_StatusType
 *
 * @Note              -
 */
Usart_StatusType Usart_SyncSendData(const uint8 Instance,
									const uint8 *TxBuff,
									const uint32 TxSize,
									const uint32 Timeout)
{
	USART_Type * Base = Usart_Base_Pointer[Instance];
	Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];
	Usart_StatusType RetVal = USART_STATUS_SUCCESS;
	boolean IsReturn = FALSE;
	
	/* Timeout Setup Variables */
	uint32 StartTime;
    uint32 TimeoutTicks;
    uint32 ElapsedTicks = 0;

    /* Check driver is not busy transmitting data from a previous asynchronous call */
    if (UartStatePtr->IsTxBusy)
    {
        RetVal = USART_STATUS_BUSY;
        IsReturn = TRUE;
    }
    if (!IsReturn)
    {
        UartStatePtr->IsTxBusy = TRUE;
        UartStatePtr->TxBuff = TxBuff;
        UartStatePtr->TxSize = TxSize;

        UartStatePtr->TransmitStatus = USART_STATUS_BUSY;

        /* Disable TX data register empty and transmission complete interrupt */
        Usart_SetIntMode(Base, USART_INT_TX_DATA_REG_EMPTY, DISABLE);
        Usart_SetIntMode(Base, USART_INT_TX_COMPLETE, DISABLE);

        /* Enable the USART transmitter */
        Usart_SetTransmitterCmd(Base, TRUE);
		
		/* Start Timeout - Can using Sys-tick Timer */
        Systick_StartTimeout(&StartTime, &TimeoutTicks, Timeout);
		
		/* Wait transfer successfully or Timeout occurs */
        while ( (UartStatePtr->TxSize > 0U) && \
                !Systick_CheckTimeout(&StartTime, &ElapsedTicks, TimeoutTicks) )
        {
            Usart_PutData(Instance);
            while ( !Usart_GetStatusFlag(Base, USART_FLAG_TX_DATA_REG_EMPTY)  && \
                    !Systick_CheckTimeout(&StartTime, &ElapsedTicks, TimeoutTicks) );
        }

        /* Disable the USART transmitter */
        Usart_SetTransmitterCmd(Base, DISABLE);

        /* Check if Timeout occur */
        if ( Systick_CheckTimeout(&StartTime, &ElapsedTicks, TimeoutTicks) )
        {
            UartStatePtr->TransmitStatus = USART_STATUS_TIMEOUT;
        }
		else	/* The transmit process is complete */
        {
            UartStatePtr->TransmitStatus = USART_STATUS_SUCCESS;
        }
        UartStatePtr->IsTxBusy = FALSE;
        RetVal = UartStatePtr->TransmitStatus;
    }
    return RetVal;
}


/*********************************************************************
 * @fn      		  - Usart_AsyncSendData
 *
 * @brief             - Asynchronous Send Data - Send Data and no wait (Interrupt or DMA)
 *
 * @param[in]         - Instance 	- USART Hardware Instance
 * @param[in]         - TxBuff 		- Buffer to transmission
 * @param[in]         - TxSize 		- Size of Buffer to transmission
 *
 * @return            - Usart_StatusType
 *
 * @Note              -
 */
Usart_StatusType Usart_AsyncSendData(const uint8 Instance,
									const uint8 *TxBuff,
									const uint32 TxSize)
{
	Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];
	const Usart_UserConfigType * UartUserCfg = Usart_UserConfig_Pointer[Instance];
	Usart_StatusType RetVal = USART_STATUS_SUCCESS;
	boolean IsReturn = FALSE;
	
	if (UartStatePtr->IsTxBusy)
    {
        RetVal = USART_STATUS_BUSY;
        IsReturn = TRUE;
    }
	if (!IsReturn)
    {
        UartStatePtr->IsTxBusy = TRUE;

        if (USART_USING_INTERRUPTS == UartUserCfg->USART_Transfer)
        {
            /* Start the transmission process using interrupts */
            RetVal = Usart_StartSendDataINT(Instance, TxBuff, TxSize);
        }
#if (USART_DMA_ENABLED == ON)
        else
        {
            /* Start the transmission process using DMA */
            /*RetVal = Usart_StartSendDataDMA(Instance, TxBuff, TxSize);*/
        }
#endif
    }
    return RetVal;
}

/*********************************************************************
 * @fn      		  - Usart_SyncReceiveData
 *
 * @brief             - Synchronus Receive Data - Wait to Receive ok or timeout
 *
 * @param[in]         - Instance 	- USART Hardware Instance
 * @param[in]         - RxBuff 		- Buffer to Receive
 * @param[in]         - RxSize 		- Size of Buffer to Receive
 * @param[in]         - Timeout 	- Timeout if data cannot Receive (us)
 *
 * @return            - Usart_StatusType
 *
 * @Note              -
 */
Usart_StatusType Usart_SyncReceiveData(const uint8 Instance,
                                       uint8 *RxBuff,
                                       const uint32 RxSize,
                                       const uint32 Timeout)
{
	USART_Type * Base = Usart_Base_Pointer[Instance];
	Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];
	Usart_StatusType RetVal = USART_STATUS_SUCCESS;
	boolean IsReturn = FALSE;
	
	/* Timeout Setup Variables */
	uint32 StartTime;
    uint32 TimeoutTicks;
    uint32 ElapsedTicks = 0;

