nghia12a1-t-ara/STM32_myDevelopment_Framework/STM32F4_Drivers/USART/src/USART.c
    /* Check driver is not busy receiving data from a previous asynchronous call */
    if (UartStatePtr->IsRxBusy)
    {
        RetVal = USART_STATUS_BUSY;
        IsReturn = TRUE;
    }
    if (!IsReturn)
    {
        UartStatePtr->IsRxBusy = TRUE;
        UartStatePtr->RxBuff = RxBuff;
        UartStatePtr->RxSize = RxSize;
        UartStatePtr->ReceiveStatus = USART_STATUS_BUSY;

        /* Disable RX data register full */
        Usart_SetIntMode(Base, USART_INT_RX_DATA_REG_FULL, DISABLE);
        /* Enable the USART receiver */
        Usart_SetReceiveCmd((USART_Type *)Base, ENABLE);

        Systick_StartTimeout(&StartTime, &TimeoutTicks, Timeout);

        Usart_StartGetData(Instance, &StartTime, &ElapsedTicks, TimeoutTicks);

        /* Check if Timeout occur */
        if (Systick_CheckTimeout(&StartTime, &ElapsedTicks, TimeoutTicks))
        {
            UartStatePtr->ReceiveStatus = USART_STATUS_TIMEOUT;
        }

        /* Check other success receiving case*/
        if (USART_STATUS_BUSY == UartStatePtr->ReceiveStatus)
        {
            UartStatePtr->ReceiveStatus = USART_STATUS_SUCCESS;
        }

        if ((0U == UartStatePtr->RxSize) && (USART_STATUS_RX_OVERRUN == UartStatePtr->ReceiveStatus))
        {
            UartStatePtr->ReceiveStatus = USART_STATUS_SUCCESS;
        }

        /* Disable the LPUART receiver */
        Usart_SetReceiveCmd((USART_Type *)Base, DISABLE);

        UartStatePtr->IsRxBusy = FALSE;

        /* Read dummy to clear RDRF flag */
        (void)Usart_Getchar(Base);

        RetVal = UartStatePtr->ReceiveStatus;
    }
    return RetVal;
}


/*********************************************************************
 * @fn      		  - Usart_AsyncReceiveData
 *
 * @brief             - Asynchronous Receive Data - Receive Data and no wait (Interrupt or DMA)
 *
 * @param[in]         - Instance 	- USART Hardware Instance
 * @param[in]         - RxBuff 		- Buffer to Receive
 * @param[in]         - RxSize 		- Size of Buffer to Receive
 *
 * @return            - Usart_StatusType
 *
 * @Note              -
 */
Usart_StatusType Usart_AsyncReceiveData(const uint8 Instance,
                                        uint8 * RxBuff,
                                        const uint32 RxSize)
{
	const Usart_UserConfigType * UartUserCfg = Usart_UserConfig_Pointer[Instance];
	Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];	
	Usart_StatusType RetVal = USART_STATUS_SUCCESS;
	boolean IsReturn = FALSE;
	
    /* Check it's not busy receiving data from a previous function call */
    if (UartStatePtr->IsRxBusy)
    {
        RetVal = USART_STATUS_BUSY;
        IsReturn = TRUE;
    }
    if (!IsReturn)
    {
        UartStatePtr->IsRxBusy = TRUE;

        if (USART_USING_INTERRUPTS == UartUserCfg->USART_Transfer)
        {
            /* Start the reception process using interrupts */
            RetVal = Usart_StartReceiveDataINT(Instance, RxBuff, RxSize);
        }
#if (USART_DMA_ENABLED == ON)
        else
        {
            /* Start the transmission process using DMA */
            /*RetVal = Usart_StartReceiveDataDMA(Instance, RxBuff, RxSize);*/
        }
#endif
    }
    return RetVal;
}

/*********************************************************************
 * @fn      		  - USART_SetBaudRate
 *
 * @brief             - Setting Baud-rate for USART Driver
 *
 * @param[in]         - Instance - number of Hardware Instance
 * @param[in]         - BaudRate
 *
 * @return            -
 *
 * @Note              -
 */
void Usart_SetBaudRate(const uint8 Instance, Usart_BaudrateType BaudRate)
{
	USART_Type * Base = Usart_Base_Pointer[Instance];
	
	/* Variable to hold the APB clock */
	uint32 PCLKx;
	uint32 usartdiv;

	/* Variables to hold Mantissa and Fraction values */
	uint32 M_part, F_part;
	uint32 tempreg = 0;

	PCLKx = RCC_GetClockValue(Base);

	/* Check for OVER8 configuration bit */
	if ( Base->CR1 & USART_CR1_OVER8_MASK )
	{
		/* OVER8 = 1 , over sampling by 8 */
		usartdiv = ((25 * PCLKx) / (2 * (uint32)BaudRate));
	}
	else
	{
		/* Over sampling by 16 */
		usartdiv = ((25 * PCLKx) / (4 * (uint32)BaudRate));
	}

	/* Calculate the Mantissa part */
	M_part = usartdiv/100;

	/* Place the Mantissa part in appropriate bit position . refer USART_BRR */
	tempreg |= M_part << 4;

	/* Extract the fraction part */
	F_part = (usartdiv - (M_part * 100));

	/* Calculate the final fractional */
	if ( Base->CR1 & USART_CR1_OVER8_MASK )
	{
		/* OVER8 = 1 , over sampling by 8 */
		F_part = ((( F_part * 8)+ 50) / 100) & ((uint8)0x07);

	}else
	{
		/* Over sampling by 16 */
		F_part = ((( F_part * 16)+ 50) / 100) & ((uint8)0x0F);
	}

	/* Place the fractional part in appropriate bit position . refer USART_BRR */
	tempreg |= F_part;

	/* Copy the value of tempreg in to BRR register */
	Base->BRR = tempreg;
}

/*******************************************************************************
 *
 * Function Name : Usart_IrqHandler
 * Description   : Interrupt handler for USART.
 * This handler uses the buffers stored in the Usart_StateStructureType structs to transfer
 * data. This is not a public API as it is called by IRQ whenever an interrupt
 * occurs.
 *
 *****************************************************************************/
void Usart_IrqHandler(const uint8 Instance)
{
    USART_Type * Base = Usart_Base_Pointer[Instance];
	const Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];	
    boolean IsReturn = FALSE;

    /* Case of spurious interrupt when driver is not at all initialized or it is not in transmit/receive process*/
    if (NULL_PTR == UartStatePtr)
    {
        /* Read dummy to clear RDRF flag if it is set*/
        (void)Usart_Getchar(Base);
        /* Clear all the error flags */
        Usart_ClearErrorFlags(Base);
        /* Transmit flags can not be cleared, return to exit */
    }
    else
    {
        Usart_ErrIrqHandler(Instance);
        /* Handle receive data full interrupt */
        if (Usart_GetStatusFlag(Base, USART_FLAG_RX_DATA_REG_FULL))
        {
            if (Usart_GetIntMode(Base, USART_INT_RX_DATA_REG_FULL))
            {
                Usart_RxIrqHandler(Instance);
            }
            /* Case of spurious interrupt when the interrupt enable flag is not set and respective interrupt status flag is set */
            else
            {
                /* Read dummy to clear RDRF flag */
                (void)Usart_Getchar(Base);
            }
            IsReturn = TRUE;
        }
        /* Handle transmitter data register empty interrupt */
        if (Usart_GetStatusFlag(Base, USART_FLAG_TX_DATA_REG_EMPTY) && (FALSE == IsReturn))
        {
            if (Usart_GetIntMode(Base, USART_INT_TX_DATA_REG_EMPTY))
            {
                Usart_TxEmptyIrqHandler(Instance);
                IsReturn = TRUE;
            }
            /* Case of spurious interrupt when the interrupt enable flag is not set and respective interrupt status flag is set */
            else
            {
                /* Do nothing, because TDRE can not clear without affecting to normal operation*/
            }
        }
        /* Handle transmission complete interrupt */
        if (Usart_GetStatusFlag(Base, USART_FLAG_TX_COMPLETE) && (FALSE == IsReturn))
        {
            if (Usart_GetIntMode(Base, USART_INT_TX_COMPLETE))
            {
                Usart_TxCompleteIrqHandler(Instance);
            }
            /* Case of spurious interrupt when the interrupt enable flag is not set and respective interrupt status flag is set */
            else
            {
                /* Do nothing, because TC can not clear without affecting to normal operation*/
            }
        }
    }
}

