nghia12a1-t-ara/STM32_myDevelopment_Framework/STM32F4_Drivers/USART/src/USART.c
/*******************************************************************************
 *
 * Function Name : Usart_RxIrqHandler
 * Description   : Rx Interrupt handler for USART.
 * This function treats the rx full interrupt.
 *
 *****************************************************************************/
static void Usart_RxIrqHandler(const uint8 Instance)
{
	const Usart_UserConfigType * UartUserCfg = Usart_UserConfig_Pointer[Instance];
	const Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];

    /* Get data and put in receive buffer  */
    Usart_GetData(Instance);

    /* Check if this was the last byte in the current buffer */
    if (0U == UartStatePtr->RxSize)
    {
        /* Invoke callback if there is one (callback may reset the rx buffer for continuous reception) */
        if (UartUserCfg->Callback != NULL_PTR)
        {
            UartUserCfg->Callback(Instance, USART_EVENT_RX_FULL, UartUserCfg->CallbackParam);
        }
    }

    /* Finish reception if this was the last byte received */
    if (0U == UartStatePtr->RxSize)
    {
        /* Complete transfer (disable rx logic) */
        Usart_CompleteReceiveDataINT(Instance);

        /* Invoke callback if there is one */
        if (UartUserCfg->Callback != NULL_PTR)
        {
            UartUserCfg->Callback(Instance, USART_EVENT_END_TRANSFER, UartUserCfg->CallbackParam);
        }
    }
}

/*******************************************************************************
 *
 * Function Name : Usart_TxEmptyIrqHandler
 * Description   : TX Empty Interrupt handler for USART.
 * This function treats the TX empty interrupt.
 *
 *****************************************************************************/
static void Usart_TxEmptyIrqHandler(const uint8 Instance)
{
    USART_Type * Base = Usart_Base_Pointer[Instance];
	const Usart_UserConfigType * UartUserCfg = Usart_UserConfig_Pointer[Instance];
	const Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];

    /* Check if there are any more bytes to send */
    if (UartStatePtr->TxSize > 0U)
    {
        /* Transmit the data */
        Usart_PutData(Instance);

        /* Check if this was the last byte in the current buffer */
        if ((0U == UartStatePtr->TxSize) && (UartUserCfg->Callback != NULL_PTR))
        {
            /* Invoke callback if there is one (callback may reset the TX buffer for continuous transmission)*/
            UartUserCfg->Callback(Instance, USART_EVENT_TX_EMPTY, UartUserCfg->CallbackParam);
        }
        /* If there's no new data, disable tx empty interrupt and enable transmission complete interrupt */
        if (0U == UartStatePtr->TxSize)
        {
            Usart_SetIntMode(Base, USART_INT_TX_DATA_REG_EMPTY, DISABLE);
            Usart_SetIntMode(Base, USART_INT_TX_COMPLETE, ENABLE);
        }
    }
}

/*******************************************************************************
 *
 * Function Name : Usart_TxCompleteIrqHandler
 * Description   : Tx Complete Interrupt handler for USART.
 * This function treats the tx complete interrupt.
 *
 *****************************************************************************/
static void Usart_TxCompleteIrqHandler(const uint8 Instance)
{
	const Usart_UserConfigType * UartUserCfg = Usart_UserConfig_Pointer[Instance];
	const Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];

    if (0U == UartStatePtr->TxSize)
    {
        if (USART_USING_INTERRUPTS == UartUserCfg->USART_Transfer)
        {
            /* Complete the interrupt based transfer */
            Usart_CompleteSendDataINT(Instance);
        }
        /* Invoke callback if there is one */
        if (UartUserCfg->Callback != NULL_PTR)
        {
            UartUserCfg->Callback(Instance, USART_EVENT_END_TRANSFER, UartUserCfg->CallbackParam);
        }
    }
}

/*******************************************************************************
 *
 * Function Name : Usart_ErrIrqHandler
 * Description   : Error Interrupt handler for USART.
 * This function treats the error interrupts.
 *
 *****************************************************************************/
static void Usart_ErrIrqHandler(const uint8 Instance)
{
    USART_Type * Base = Usart_Base_Pointer[Instance];
	const Usart_UserConfigType * UartUserCfg = Usart_UserConfig_Pointer[Instance];
	Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];
    boolean IsError = FALSE;
    boolean IsReturn = FALSE;

    /* Handle receive overrun interrupt */
    if (Usart_GetStatusFlag(Base, USART_FLAG_RX_OVERRUN))
    {
        /* Clear the flag */
        Usart_ClearStatusFlag(Base, USART_FLAG_RX_OVERRUN);
        /* Case of spurious interrupt when interrupt enable bit is not set*/
#ifdef USART_INT_RX_OVERRUN
        if (!Usart_GetIntMode(Base, USART_INT_RX_OVERRUN))
#else
        if (0)
#endif
        {
            IsReturn = TRUE;
        }
        else
        {
            /* Update the status */
            IsError = TRUE;
            UartStatePtr->ReceiveStatus = USART_STATUS_RX_OVERRUN;
        }
    }
    /* Handle framing error interrupt */
    if (Usart_GetStatusFlag(Base, USART_FLAG_FRAME_ERR) && (FALSE == IsReturn))
    {
        /* Clear the flag */
        Usart_ClearStatusFlag(Base, USART_FLAG_FRAME_ERR);
        /* Case of spurious interrupt when interrupt enable bit is not set*/
        if (!Usart_GetIntMode(Base, USART_INT_FRAME_ERR_FLAG))
        {
            IsReturn = TRUE;
        }
        else
        {
            /* Update the status */
            IsError = TRUE;
            UartStatePtr->ReceiveStatus = USART_STATUS_FRAMING_ERROR;
        }
    }
    /* Handle parity error interrupt */
    if (Usart_GetStatusFlag(Base, USART_FLAG_PARITY_ERR) && (FALSE == IsReturn))
    {
        /* Clear the flag */
        Usart_ClearStatusFlag(Base, USART_FLAG_PARITY_ERR);
        /* Case of spurious interrupt when interrupt enable bit is not set*/
        if (!Usart_GetIntMode(Base, USART_INT_PARITY_ERR_FLAG))
        {
            IsReturn = TRUE;
        }
        else
        {
            /* Update the status */
            IsError = TRUE;
            UartStatePtr->ReceiveStatus = USART_STATUS_PARITY_ERROR;
        }
    }
    /* Handle noise error interrupt */
	// if (Usart_GetStatusFlag(Base, USART_FLAG_NOISE_DETECT) && (FALSE == IsReturn))
    // {
        // /* Clear the flag */
        // Usart_ClearStatusFlag(Base, USART_FLAG_NOISE_DETECT);
        // /* Case of spurious interrupt when interrupt enable bit is not set*/
        // if (!Usart_GetIntMode(Base, USART_INT_NOISE_ERR_FLAG))
        // {
            // IsReturn = TRUE;
        // }
        // else
        // {
            // /* Update the internal status */
            // IsError = TRUE;
            // UartStatePtr->ReceiveStatus = USART_STATUS_NOISE_ERROR;
        // }
    // }
    if (FALSE == IsReturn)
    {
        if (TRUE == IsError)
        {
            if (USART_USING_INTERRUPTS == UartUserCfg->USART_Transfer)
            {
                /* Complete the transfer (disable rx logic) */
                Usart_CompleteReceiveDataINT(Instance);
            }
#if (USART_DMA_ENABLED == ON)
            else
            {
                /* Complete the transfer (stop DMA channel) */
                /*(void)Dma_Ip_SetLogicChannelCommand(UartUserCfg->RxDMAChannel, DMA_IP_CH_CLEAR_HARDWARE_REQUEST);
                Usart_CompleteReceiveUsingDma(Instance);*/
            }
#endif
            /* Invoke callback if there is one */
            if (UartUserCfg->Callback != NULL_PTR)
            {
                UartUserCfg->Callback(Instance, USART_EVENT_ERROR, UartUserCfg->CallbackParam);
            }
        }
    }
}


