nghia12a1-t-ara/STM32_myDevelopment_Framework/STM32F4_Drivers/USART/src/USART.c
/*******************************************************************************
 *
 * Function Name : Usart_CompleteReceiveDataINT
 * Description   : Finish up a receive by completing the process of receiving data
 * and disabling the interrupt.
 *
 ******************************************************************************/
static void Usart_CompleteReceiveDataINT(const uint8 Instance)
{
	USART_Type * Base = Usart_Base_Pointer[Instance];
	Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];

    /* Disable all error interrupts */
    /* Usart_SetIntMode(Base, USART_INT_RX_OVERRUN, DISABLE);
       Usart_SetIntMode(Base, USART_INT_NOISE_ERR_FLAG, DISABLE); */
    Usart_SetIntMode(Base, USART_INT_PARITY_ERR_FLAG, DISABLE);
    Usart_SetIntMode(Base, USART_INT_FRAME_ERR_FLAG, DISABLE);

    /* Disable receive data full and rx overrun interrupt. */
    Usart_SetIntMode(Base, USART_INT_RX_DATA_REG_FULL, DISABLE);

    /* Disable receiver */
    Usart_SetReceiveCmd(Base, DISABLE);

    /* Read dummy to clear RDRF flag */
    (void)Usart_Getchar(Base);

    /* Update the information of the module driver state */
    UartStatePtr->IsRxBusy = FALSE;

    if (USART_STATUS_BUSY == UartStatePtr->ReceiveStatus)
    {
        UartStatePtr->ReceiveStatus = USART_STATUS_SUCCESS;
    }
}

/******************************************************************************
 *
 * Function Name : Usart_CompleteSendDataINT
 * Description   : Finish up a transmit by completing the process of sending
 * data and disabling the interrupt.
 *
 ******************************************************************************/
static void Usart_CompleteSendDataINT(const uint8 Instance)
{
	USART_Type * Base = Usart_Base_Pointer[Instance];
	Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];
    uint32 StartTime;
    uint32 TimeoutTicks;
    uint32 ElapsedTicks = 0;

    if (USART_STATUS_BUSY != UartStatePtr->TransmitStatus)
    {
        /* If the transfer is aborted or timed out, disable tx empty interrupt */
        Usart_SetIntMode(Base, USART_INT_TX_DATA_REG_EMPTY, FALSE);
    }

    /* Disable transmission complete interrupt */
    Usart_SetIntMode(Base, USART_INT_TX_COMPLETE, FALSE);

    Systick_StartTimeout(&StartTime, &TimeoutTicks, USART_TIMEOUT_VALUE_US);
    /* Wait until the data is completely shifted out of shift register */
    while (!Usart_GetStatusFlag(Base, USART_FLAG_TX_COMPLETE) && \
           !Systick_CheckTimeout(&StartTime, &ElapsedTicks, TimeoutTicks))
    {}

    if (Systick_CheckTimeout(&StartTime, &ElapsedTicks, TimeoutTicks))
    {
        /* In case timeout occur */
        UartStatePtr->TransmitStatus = USART_STATUS_TIMEOUT;
    }
    /* Disable transmitter */
    Usart_SetTransmitterCmd(Base, DISABLE);

    if (USART_STATUS_BUSY == UartStatePtr->TransmitStatus)
    {
        /* If the transfer is completed, update the transmit status */
        UartStatePtr->TransmitStatus = USART_STATUS_SUCCESS;
    }

    /* Update the internal busy flag */
    UartStatePtr->IsTxBusy = FALSE;
}

/*********************************************************************
 * @fn                - Usart_StartSendDataINT
 *
 * @brief             - Initiate (start) a transmit by beginning the process of
 *                      sending data and enabling the interrupt.
 */
static Usart_StatusType Usart_StartSendDataINT(const uint8 Instance,
                                               const uint8 *TxBuff,
                                               const uint32 TxSize)
{
    USART_Type * Base = Usart_Base_Pointer[Instance];
    Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];	

    /* Initialize state structure */
    UartStatePtr->TxBuff = TxBuff;
    UartStatePtr->TxSize = TxSize;
    UartStatePtr->TransmitStatus = USART_STATUS_BUSY;

    /* Enable the USART Transmitter */
    Usart_SetTransmitterCmd(Base, ENABLE);

    /* Enable TX Empty Interrupt */
    Usart_SetIntMode(Base, USART_INT_TX_DATA_REG_EMPTY, ENABLE);

    return USART_STATUS_SUCCESS;
}

/*********************************************************************
 * @fn                - Usart_StartReceiveDataINT
 *
 * @brief             - Initiate (start) a transmit by beginning the process of
 *                      sending data and enabling the interrupt.
 */
static Usart_StatusType Usart_StartReceiveDataINT(const uint8 Instance,
                                                  uint8 * RxBuff,
                                                  const uint32 RxSize)
{
    USART_Type * Base = Usart_Base_Pointer[Instance];
    Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];

    /* Initialize the module driver state structure to indicate transfer in progress
     * and with the buffer and byte count data. */
    UartStatePtr->IsRxBusy = TRUE;
    UartStatePtr->RxBuff = RxBuff;
    UartStatePtr->RxSize = RxSize;
    UartStatePtr->ReceiveStatus = USART_STATUS_BUSY;

    /* Clear all the error flags */
    Usart_ClearErrorFlags(Base);

    /* Enable the receiver */
    Usart_SetReceiveCmd(Base, TRUE);

    /* Enable error interrupts */
    /* Usart_SetIntMode(Base, USART_INT_RX_OVERRUN, TRUE);
       Usart_SetIntMode(Base, USART_INT_NOISE_ERR_FLAG, TRUE); */
    Usart_SetIntMode(Base, USART_INT_PARITY_ERR_FLAG, TRUE);
    Usart_SetIntMode(Base, USART_INT_FRAME_ERR_FLAG, TRUE);

    /* Enable receive data full interrupt */
    Usart_SetIntMode(Base, USART_INT_RX_DATA_REG_FULL, TRUE);

    return USART_STATUS_SUCCESS;
}


/*********************************************************************
 * @fn                - Usart_PutData
 *
 * @brief             - Initiate (start) a transmit by beginning the process of
 *                      sending data and enabling the interrupt.
 */
static void Usart_PutData(const uint8 Instance)
{
    USART_Type * Base = Usart_Base_Pointer[Instance];
    const Usart_UserConfigType * UartUserCfg = Usart_UserConfig_Pointer[Instance];
    Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];
    uint16 Data16b;
    uint8 Data8b;

    if ( USART_WORDLEN_8BITS == UartUserCfg->USART_WordLength )
    {
        Data8b = *(UartStatePtr->TxBuff);
        /* Update the state structure */
        ++UartStatePtr->TxBuff;
        --UartStatePtr->TxSize;
        /* Transmit the data */
        Usart_Putchar(Base, Data8b);
    }
    else
    {
        Data16b = (uint16)(*UartStatePtr->TxBuff);
        /* Update the state structure */
        if (1U == UartStatePtr->TxSize)
        {
            ++UartStatePtr->TxBuff;
            --UartStatePtr->TxSize;
        }
        else
        {
            ++UartStatePtr->TxBuff;
            Data16b |= (uint16)(((uint16)(*UartStatePtr->TxBuff)) << 8U);

            ++UartStatePtr->TxBuff;
            UartStatePtr->TxSize -= 2U;
        }

        /* Transmit the data */
        if ( USART_WORDLEN_9BITS == UartUserCfg->USART_WordLength )
        {
            Usart_Putchar9(Base, Data16b);
        }
        else
        {
            /* TODO - 10 bits */
        }
    }
}

/*********************************************************************
 * @fn                - Usart_GetData
 *
 * @brief             - Get Data From RX Transfer
 */
static void Usart_GetData(const uint8 Instance)
{
    USART_Type * Base = Usart_Base_Pointer[Instance];
    const Usart_UserConfigType * UartUserCfg = Usart_UserConfig_Pointer[Instance];
    Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];
    uint16 Data16b;

    if ( USART_WORDLEN_8BITS == UartUserCfg->USART_WordLength )
    {
        /* Receive the data */
        *(UartStatePtr->RxBuff) = Usart_Getchar(Base);
        /* Update the state structure */
        ++UartStatePtr->RxBuff;
        --UartStatePtr->RxSize;
    }
    else
    {
        if ( USART_WORDLEN_9BITS == UartUserCfg->USART_WordLength )
        {
            Data16b = Usart_Getchar9(Base);
        }
        else
        {
            /* TODO - 10 bits */
        }
        /* Get the data and update state structure */
        if (1U == UartStatePtr->RxSize)
        {
            *(UartStatePtr->RxBuff) = (uint8)Data16b;
            ++UartStatePtr->RxBuff;
            --UartStatePtr->RxSize;
        }
        else
        {
            /* Write the least significant bits to the receive buffer */
            *(UartStatePtr->RxBuff) = (uint8)(Data16b & 0xFFU);
            ++UartStatePtr->RxBuff;
            /* Write the ninth bit to the subsequent byte in the RX buffer */
            *UartStatePtr->RxBuff = (uint8)(Data16b >> 8U);
            ++UartStatePtr->RxBuff;
            UartStatePtr->RxSize -= 2U;
        }
    }
}

/**************************************************************************
 *
 * Function Name : Usart_StartGetData
 * Description   : Start Getting Data in SyncReceive mode
 *
 ***************************************************************************/
static void Usart_StartGetData(const uint8 Instance, uint32 * StartTime, uint32 * ElapsedTicks, uint32 TimeoutTicks)
{
    USART_Type * Base = Usart_Base_Pointer[Instance];
    Usart_StateRuntimeType * UartStatePtr = Usart_StateRuntime_Pointer[Instance];
    
    while ((UartStatePtr->RxSize > 0U) && \
            !Systick_CheckTimeout(StartTime, ElapsedTicks, TimeoutTicks))
    {
        /* Wait until data reception flag is set or timeout occurs if there is an error during reception */
        while (!Usart_GetStatusFlag((const USART_Type*)Base, USART_FLAG_RX_DATA_REG_FULL) && \
            !Systick_CheckTimeout(StartTime, ElapsedTicks, TimeoutTicks))
        {}
        /* Check for errors on received data */
        /* @TODO */
        
        /* Get received data */
        Usart_GetData(Instance);
    }
}
